function e(e, r, t) {
    return r in e ? Object.defineProperty(e, r, {
        value: t,
        enumerable: !0,
        configurable: !0,
        writable: !0
    }) : e[r] = t, e;
}

var r, t = {
    info: {
        key: "ID",
        keytype: "int"
    },
    head: [ "ID", "String" ],
    body: (r = {}, e(r, 1013, [ 1013, "确定" ]), e(r, 1014, [ 1014, "取消" ]), e(r, 1019, [ 1019, "稍等片刻" ]), 
    e(r, 1020, [ 1020, "正在登陆" ]), e(r, 1021, [ 1021, "放弃比赛，损失{0}金币" ]), e(r, 1039, [ 1039, "需要获取您的公开信息" ]), 
    e(r, 1040, [ 1040, "仅获取您的公开信息（昵称、头像等），不会获取您的任何隐私信息，以及泄露您的公开信息。" ]), e(r, 1044, [ 1044, "{0}小时" ]), 
    e(r, 1045, [ 1045, "剩余{0}小时" ]), e(r, 1046, [ 1046, "续期" ]), e(r, 1052, [ 1052, "{0}小时" ]), 
    e(r, 1053, [ 1053, "{0}天" ]), e(r, 1054, [ 1054, "剩余：{0}小时" ]), e(r, 1055, [ 1055, "剩余：{0}天" ]), 
    e(r, 1056, [ 1056, "兑换确认" ]), e(r, 1057, [ 1057, "确定使用 {0}{1}<br />兑换 {2} {3}？" ]), 
    e(r, 1058, [ 1058, "提示" ]), e(r, 1059, [ 1059, "货币不足！" ]), e(r, 1060, [ 1060, "超出购买数量限制！" ]), 
    e(r, 1061, [ 1061, "无效的商品！" ]), e(r, 1062, [ 1062, "发生未知错误！" ]), e(r, 1063, [ 1063, "兑换成功" ]), 
    e(r, 1064, [ 1064, "恭喜您已成功兑换 {0} {1}" ]), e(r, 1065, [ 1065, "即将上线，敬请期待！" ]), e(r, 1066, [ 1066, "分享提醒" ]), 
    e(r, 1067, [ 1067, "每个群每天可以分享一次。<br />您已经在该群分享过一次了，请明天再来。" ]), e(r, 1068, [ 1068, "分享到个人与分享到QQ群不同哦。<br />请尝试分享到QQ群吧。" ]), 
    e(r, 1069, [ 1069, "拥有数量：{0}" ]), e(r, 1070, [ 1070, "未自定义昵称" ]), e(r, 1071, [ 1071, "设置头像得{0}金币" ]), 
    e(r, 1072, [ 1072, "更新提示" ]), e(r, 1073, [ 1073, "新版本已经准备就绪，点击确定即可重启应用。" ]), e(r, 1074, [ 1074, "游戏版本已更新。<br />请退出QQ和小程序，重新进入，即可体验全新版本。" ]), 
    e(r, 1075, [ 1075, "开始游戏" ]), e(r, 1076, [ 1076, "授权登录" ]), e(r, 1077, [ 1077, "领取" ]), 
    e(r, 1078, [ 1078, "新手金币奖励" ]), e(r, 1079, [ 1079, "快来和QQ好友一起畅玩" ]), r)
};

module.exports = {
    data: t
};